---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoProfileForRail
source: html/b6294b38-434c-a05a-86ba-7991f74a5656.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoProfileForRail Property

Must specify Profiles for every Rail.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoProfileForRail { get; }
```